# fish
brew "fish"
# sehll提示以及美化
brew "starship"
# 雄心勃勃的 Vim-fork 专注于可扩展性和敏捷性
brew "neovim"
# 平铺窗口管理器
brew "felixkratz/formulae/sketchybar"
# 编写的超快终端文件管理器
brew "yazi"
# node包管理工具
brew "pnpm"
# 简单、快速和用户友好的替代方案
brew "fd"
# 语言 管理器
brew "mise"
# 用 Go 编写的命令行模糊查找器
brew "fzf"
# 轻量级灵活的命令行 JSON 处理器
brew "jq"
# tree-sitter 语法解析
brew "tree-sitter"
brew "tree-sitter-cli"
# 用于 git 命令的简单终端 UI
brew "lazygit"
# 搜索工具，如 grep 和 The Silver Searcher
brew "ripgrep"
brew "zoxide"
# ls 增强
brew "lsd"
# uv
brew "uv"
# Docker 容器管理 TUI
brew "lazydocker"
# 现代终端复用器
brew "tmux"
# GitHub CLI
brew "gh"
# 开发工具
brew "cocoapods"
brew "rtk"
brew "ollama"
# 工具
brew "mole"

# 字体
cask "font-maple-mono-nf-cn"

# 屏幕窗口管理
cask "nikitabobko/tap/aerospace"

# 阻止commnad + Q 立即退出
cask "commandq"
# 用于文本翻译和识别的软件
cask "easydict"
# 终端模拟器
cask "kitty"
# Raycast 启动器
cask "raycast"
# ai对话工具
cask "lobehub"
# neovim GUI客户端
cask "neovide-app"
# api测试工具
cask "apifox"
# 文件管理器
cask "qspace-pro"
# 音视频播放器
cask "iina"
# 微信
cask "wechat"
# 微信开发者工具
cask "wechatwebdevtools"
# 钉钉
cask "dingtalk"
# expo开发工具
cask "expo-orbit"
# docker 管理
cask "orbstack"
# figma
cask "figma"
# 输入法自动切换
cask "input-source-pro"
# vim输入法切换
cask "jackiexiao/tap/macvimswitch"
# 其他
cask "cc-switch"
cask "claude-code"
cask "feishu"
cask "thaw"
cask "xcodes-app"
